OpenFOAM-13/tutorials/incompressibleFluid/mixerSRF/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    rotor
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    cyclic_half0
    {
        type            cyclic;
        value           uniform 0;
    }
    cyclic_half1
    {
        type            cyclic;
        value           uniform 0;
    }
}


// ************************************************************************* //
